Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/BZ24/svd/PIC32CX1012BZ24032.svd
            <register>
               <name>CLKDIAG</name>
               <description>USER CLK DIAGNOSTICS CONTROL REGISTER</description>
               <addressOffset>0x190</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>POSCSTOP</name>
                     <description>POSC Clock Stop Control value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>POSCSTOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>POSC clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>POSC clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SOSCSTOP</name>
                     <description>SOSC Clock Stop Control value</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SOSCSTOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>SOSC clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>SOSC clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRCSTOP</name>
                     <description>FRC Clock Stop Control value</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FRCSTOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>FRC clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>FRC clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPRCSTOP</name>
                     <description>LPRC Clock Stop Control value</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPRCSTOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>LPRC clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>LPRC clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLL1STOP</name>
                     <description>SPLL1 Clock Stop Control value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPLL1STOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>SPLL1 clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>SPLL1 clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLL2STOP</name>
                     <description>SPLL2 Clock Stop Control value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPLL2STOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>SPLL2 clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>SPLL2 clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPLL3STOP</name>
                     <description>SPLL3 Clock Stop Control value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPLL3STOPSelect</name>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>SPLL3 clock source runs as normal</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>SPLL3 clock source is stopped</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NMICNT</name>
                     <description>NMI Counter value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
