Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/BZ24/svd/PIC32CX1012BZ24032.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ITM</name>
         <description>Instrumentation Trace Macrocell</description>
         <groupName>ITM</groupName>
         <prependToName>ITM_</prependToName>
         <baseAddress>0xE0000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xF00</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>32</dim>
               <dimIncrement>4</dimIncrement>
               <name>PORT_WORD_MODE[%s]</name>
               <description>ITM Stimulus Port Registers</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PORT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>32</dim>
               <dimIncrement>4</dimIncrement>
               <name>PORT_BYTE_MODE[%s]</name>
               <description>ITM Stimulus Port Registers</description>
               <alternateRegister>PORT_WORD_MODE[%s]</alternateRegister>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PORT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>32</dim>
               <dimIncrement>4</dimIncrement>
               <name>PORT_HWORD_MODE[%s]</name>
               <description>ITM Stimulus Port Registers</description>
               <alternateRegister>PORT_WORD_MODE[%s]</alternateRegister>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PORT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TER</name>
               <description>ITM Trace Enable Register</description>
               <addressOffset>0xE00</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>TPR</name>
               <description>ITM Trace Privilege Register</description>
               <addressOffset>0xE40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRIVMASK</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCR</name>
               <description>ITM Trace Control Register</description>
               <addressOffset>0xE80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ITMENA</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSENA</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCENA</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DWTENA</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWOENA</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLENA</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSPrescale</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GTSFREQ</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TraceBusID</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IWR</name>
               <description>ITM Integration Write Register</description>
               <addressOffset>0xEF8</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ATVALIDM</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRR</name>
               <description>ITM Integration Read Register</description>
               <addressOffset>0xEFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ATREADYM</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
